[
  {
    "title": "Node.js",
    "slug": "learn-node-js",
    "subtitle": "Learn backend development and how to make efficient and scalable Node.js web apps",
    "description": [
      "Node.js changed the game when it comes to the back-end of the web. It showed that by using JavaScript fundamentals, we could have servers handling tens of thousands of concurrent connections processed very quickly with Google's V8 engine.",
      "In this course, we'll learn what exactly Node.js does differently, how to make simple Node.js HTTP apps and various coding patterns for clean asynchronous code."
    ],
    "image": "/images/courses/nodejs.jpg",
    "icon": "nodejs",
    "upcoming": true,
    "summary": {
      "duration": "9 weeks",
      "repeat": "2 Classes Per Week",
      "cost": "$1,500",
      "schedule": "Nov 1 - Dec 22 2016"
    },
    "features": [
      {
        "title": "Concurrency",
        "icon": "fa-bar-chart",
        "description": "Learn how Node.js offers a concurrent, efficient platform to build apps."
      },
      {
        "title": "Structure",
        "icon": "fa-cubes",
        "description": "Explore how to use Node with various databases, back-end, and front-end frameworks."
      },
      {
        "title": "Boilerplate",
        "icon": "fa-gears",
        "description": "Quickly setup Gulp to deliver a React front-end and other assets."
      }
    ],
    "partial": "learn-node-js"
  },
  {
    "title": "React",
    "slug": "learn-react",
    "subtitle": "Build modern, fast, and immersive frontend web apps with the React framework",
    "description": [
      "Web apps today look a lot different than they did a few years ago. Before modern web apps, we would build apps with a back-end server generating HTML to deliver to the browser. Today the browser is fast enough that it is capable of running the entire application client-side, and simply requesting data (JSON) from the server (REST).",
      "This enables our applications to be more interactive and much more scalable. Although it does require the developer to change the way they think, the result is the ability to build immersive applications in ways we were never able to before."
    ],
    "image": "/images/courses/react.jpg",
    "icon": "react",
    "upcoming": true,
    "summary": {
      "duration": "9 weeks",
      "repeat": "2 Classes Per Week",
      "cost": "$1,500",
      "schedule": "Nov 1 - Dec 22 2016"
    },
    "features": [
      {
        "title": "Client-MVC Architecture",
        "icon": "fa-sitemap",
        "description": "Learn how to architect an app with a thick front-end for flexibility and testability."
      },
      {
        "title": "Learn JavaScript",
        "icon": "fa-code",
        "description": "No existing JavaScript knowledge necessary. By the end you'll understand events, closures, and promises."
      },
      {
        "title": "Build real apps",
        "icon": "fa-rocket",
        "description": "Project-based approach to give real world examples and good sample references after the course."
      }
    ],
    "partial": "learn-react"
  }
]
